{
  "title": "Drug Reviews",
  "description": "The dataset provides patient reviews on specific drugs along with related conditions. Furthermore, reviews are grouped into reports on the three aspects benefits, side effects and overall comment. Additionally, ratings are available concerning overall satisfaction as well as a 5 step side effect rating and a 5 step effectiveness rating. The data was obtained by crawling online pharmaceutical review sites.",
  "modelCategory": "text_classification_base",
  "schemaVersion": 1.0,
  "inputDataFormat": "CSV",
  "encoding": "utf-8",
  "id": {
    "name": "id",
    "description": "Unique identifier for each sample in the dataset."
  },
  "target": {
    "name": "effectiveness",
    "description": "..",
    "classes": [
      "Considerably Effective",
      "Highly Effective",
      "Ineffective",
      "Marginally Effective",
      "Moderately Effective"
    ]
  },
  "textField": {
    "name": "text",
    "description": "The text to be classified",
    "dataType": "TEXT",
    "example": "Initially, Lexapro helped alleviate some of the stress I was experiencing. I noticed that situations that would normally aggravate me (i.e. stress of work, children, college assignments,etc.) I was able to handle better. Although some stress was alleviated, I noticed that I spent more time in a \"vegetative\" state. I am normally a very active person who enjoys exercising daily. While on Lexapro, I found myself preferring to just relax and watch televison (did cause slight weight gain due to this). More serious and traumatizing side effects was the sudden onset of severe chest pain, rapid heartbeat, dizzy spells, sweating, fatigue, numbness in legs and nausea. The first episode occurred one day at work causing an ambulance to be dispatched to job. From that day on, these attacks happened quite frequently, my doctor took me off the medicine. However, these attacks continued to occur for over a year later (never happened to me before Lexapro). In fact, these effects started a two year long string of attacks, visits to cardiologists, emergency rooms, my fear of exercising as increased activity seemed to affect my heart and induce rapid heart beat. I began to fear driving as my dizzy spells would occur for no apparent reason, as well as the numbness in my legs. No doctor was much help, in fact I often got treated as if I was crazy and was just told that I am suffering from panic attacks. I understand that panic attacks can occur out of nowhere in ones life and once you have them you may experience continued anxiety. I believe the Lexapro opened this pandoras box for me though. I read somewhere that an earlier version of Lexapro (or similar type of pill) caused heart problems thus was pulled off the shelves. Who knows the story behind that. It has taken me two long horrific years to get back on track. I am now approaching my issues naturally and am doing better (not to say this completely stopped my life - but it did seriously change it). I took approximately 5mg a day. I visited my doctor on monthly basis, and was in contact with her via phone during first several weeks (my doc was old school... she really cares about her patients). I was placed on this treatment as I was a single mother of two very young children, employed full time, and attending college full time. The stress wasoccasionally overwhelming and my usual source of alleviating stress (exercise) was no longer helping."
  }
}